app/views/posts/index.html.erb

SELECT "posts".* FROM "posts"
---

<% Post.all.each do |p| %>